In [1]:
import pandas as pd
import numpy as np
import urllib.request
import os

In [2]:
def reduce_memory(df):
    for col in df.columns:
        col_type = df[col].dtypes
        if col_type == object:
            df[col] = df[col].astype('category')
        elif col_type in ['int64', 'int32']:
            df[col] = pd.to_numeric(df[col], downcast='integer')
        elif col_type in ['float64', 'float32']:
            df[col] = pd.to_numeric(df[col], downcast='float')
    return df

In [3]:
app = pd.read_csv(r'C:\Users\magha\OneDrive\Desktop\Home Credit EDA\data\application_train.csv', usecols=[
    'SK_ID_CURR', 'TARGET', 'AMT_INCOME_TOTAL', 'NAME_EDUCATION_TYPE'
])
app = reduce_memory(app)

In [4]:
app

        SK_ID_CURR  TARGET  AMT_INCOME_TOTAL            NAME_EDUCATION_TYPE
0           100002       1          202500.0  Secondary / secondary special
1           100003       0          270000.0               Higher education
2           100004       0           67500.0  Secondary / secondary special
3           100006       0          135000.0  Secondary / secondary special
4           100007       0          121500.0  Secondary / secondary special
...            ...     ...               ...                            ...
307506      456251       0          157500.0  Secondary / secondary special
307507      456252       0           72000.0  Secondary / secondary special
307508      456253       0          153000.0               Higher education
307509      456254       1          171000.0  Secondary / secondary special
307510      456255       0          157500.0               Higher education

[307511 rows x 4 columns]

In [6]:
app.memory_usage().sum() / 1024**2

np.float64(4.106042861938477)

In [7]:
bureau = pd.read_csv(r'C:\Users\magha\OneDrive\Desktop\Home Credit EDA\data\bureau.csv', usecols=['SK_ID_CURR', 'AMT_CREDIT_SUM'])
bureau = reduce_memory(bureau)
bureau_agg = bureau.groupby('SK_ID_CURR').agg({'AMT_CREDIT_SUM': 'mean'}).reset_index()
app = app.merge(bureau_agg, on='SK_ID_CURR', how='left')

In [8]:
app

,SK_ID_CURR,TARGET,AMT_INCOME_TOTAL,NAME_EDUCATION_TYPE,AMT_CREDIT_SUM
0,100002,1,202500.0,Secondary / secondary special,108131.945625
1,100003,0,270000.0,Higher education,254350.125000
2,100004,0,67500.0,Secondary / secondary special,94518.900000
3,100006,0,135000.0,Secondary / secondary special,NaN
4,100007,0,121500.0,Secondary / secondary special,146250.000000
...,...,...,...,...,...
307506,456251,0,157500.0,Secondary / secondary special,NaN
307507,456252,0,72000.0,Secondary / secondary special,NaN
307508,456253,0,153000.0,Higher education,990000.000000
307509,456254,1,171000.0,Secondary / secondary special,45000.000000
307510,456255,0,157500.0,Higher education,345629.045455

In [9]:
app.memory_usage().sum() / 1024**2

np.float64(6.452165603637695)

In [10]:
prev = pd.read_csv(r'C:\Users\magha\OneDrive\Desktop\Home Credit EDA\data\previous_application.csv', usecols=['SK_ID_CURR', 'AMT_ANNUITY'])
prev = reduce_memory(prev)
prev_agg = prev.groupby('SK_ID_CURR').agg({'AMT_ANNUITY': 'mean'}).reset_index()
app = app.merge(prev_agg, on='SK_ID_CURR', how='left')

In [11]:
app

,SK_ID_CURR,TARGET,AMT_INCOME_TOTAL,NAME_EDUCATION_TYPE,AMT_CREDIT_SUM,AMT_ANNUITY
0,100002,1,202500.0,Secondary / secondary special,108131.945625,9251.775000
1,100003,0,270000.0,Higher education,254350.125000,56553.990000
2,100004,0,67500.0,Secondary / secondary special,94518.900000,5357.250000
3,100006,0,135000.0,Secondary / secondary special,NaN,23651.175000
4,100007,0,121500.0,Secondary / secondary special,146250.000000,12278.805000
...,...,...,...,...,...,...
307506,456251,0,157500.0,Secondary / secondary special,NaN,6605.910000
307507,456252,0,72000.0,Secondary / secondary special,NaN,10074.465000
307508,456253,0,153000.0,Higher education,990000.000000,4770.405000
307509,456254,1,171000.0,Secondary / secondary special,45000.000000,10681.132500
307510,456255,0,157500.0,Higher education,345629.045455,20775.391875

In [12]:
app.memory_usage().sum() / 1024**2

np.float64(8.798288345336914)

In [13]:
inst = pd.read_csv(r'C:\Users\magha\OneDrive\Desktop\Home Credit EDA\data\installments_payments.csv', usecols=['SK_ID_CURR', 'AMT_PAYMENT'])
inst = reduce_memory(inst)
inst_agg = inst.groupby('SK_ID_CURR').agg({'AMT_PAYMENT': 'mean'}).reset_index()
app = app.merge(inst_agg, on='SK_ID_CURR', how='left')

In [14]:
app

,SK_ID_CURR,TARGET,AMT_INCOME_TOTAL,NAME_EDUCATION_TYPE,AMT_CREDIT_SUM,AMT_ANNUITY,AMT_PAYMENT
0,100002,1,202500.0,Secondary / secondary special,108131.945625,9251.775000,11559.247105
1,100003,0,270000.0,Higher education,254350.125000,56553.990000,64754.586000
2,100004,0,67500.0,Secondary / secondary special,94518.900000,5357.250000,7096.155000
3,100006,0,135000.0,Secondary / secondary special,NaN,23651.175000,62947.088438
4,100007,0,121500.0,Secondary / secondary special,146250.000000,12278.805000,12214.060227
...,...,...,...,...,...,...,...
307506,456251,0,157500.0,Secondary / secondary special,NaN,6605.910000,7492.924286
307507,456252,0,72000.0,Secondary / secondary special,NaN,10074.465000,10069.867500
307508,456253,0,153000.0,Higher education,990000.000000,4770.405000,4115.915357
307509,456254,1,171000.0,Secondary / secondary special,45000.000000,10681.132500,10239.832895
307510,456255,0,157500.0,Higher education,345629.045455,20775.391875,47646.215878

In [17]:

print(app.memory_usage().sum() / 1024**2)

11.144411087036133

In [18]:
cc = pd.read_csv(r'C:\Users\magha\OneDrive\Desktop\Home Credit EDA\data\credit_card_balance.csv', usecols=['SK_ID_CURR', 'AMT_DRAWINGS_CURRENT'])
cc = reduce_memory(cc)
cc_agg = cc.groupby('SK_ID_CURR').agg({'AMT_DRAWINGS_CURRENT': 'mean'}).reset_index()
app = app.merge(cc_agg, on='SK_ID_CURR', how='left')

In [19]:
app

,SK_ID_CURR,TARGET,AMT_INCOME_TOTAL,NAME_EDUCATION_TYPE,AMT_CREDIT_SUM,AMT_ANNUITY,AMT_PAYMENT,AMT_DRAWINGS_CURRENT
0,100002,1,202500.0,Secondary / secondary special,108131.945625,9251.775000,11559.247105,NaN
1,100003,0,270000.0,Higher education,254350.125000,56553.990000,64754.586000,NaN
2,100004,0,67500.0,Secondary / secondary special,94518.900000,5357.250000,7096.155000,NaN
3,100006,0,135000.0,Secondary / secondary special,NaN,23651.175000,62947.088438,0.0
4,100007,0,121500.0,Secondary / secondary special,146250.000000,12278.805000,12214.060227,NaN
...,...,...,...,...,...,...,...,...
307506,456251,0,157500.0,Secondary / secondary special,NaN,6605.910000,7492.924286,NaN
307507,456252,0,72000.0,Secondary / secondary special,NaN,10074.465000,10069.867500,NaN
307508,456253,0,153000.0,Higher education,990000.000000,4770.405000,4115.915357,NaN
307509,456254,1,171000.0,Secondary / secondary special,45000.000000,10681.132500,10239.832895,NaN
307510,456255,0,157500.0,Higher education,345629.045455,20775.391875,47646.215878,NaN

In [20]:
app.memory_usage().sum() / 1024**2

np.float64(13.490533828735352)

In [21]:
pos = pd.read_csv(r'C:\Users\magha\OneDrive\Desktop\Home Credit EDA\data\POS_CASH_balance.csv', usecols=['SK_ID_CURR', 'MONTHS_BALANCE'])
pos = reduce_memory(pos)
pos_agg = pos.groupby('SK_ID_CURR').agg({'MONTHS_BALANCE': 'count'}).reset_index()
app = app.merge(pos_agg, on='SK_ID_CURR', how='left')

In [22]:
app

,SK_ID_CURR,TARGET,AMT_INCOME_TOTAL,NAME_EDUCATION_TYPE,AMT_CREDIT_SUM,AMT_ANNUITY,AMT_PAYMENT,AMT_DRAWINGS_CURRENT,MONTHS_BALANCE
0,100002,1,202500.0,Secondary / secondary special,108131.945625,9251.775000,11559.247105,NaN,19.0
1,100003,0,270000.0,Higher education,254350.125000,56553.990000,64754.586000,NaN,28.0
2,100004,0,67500.0,Secondary / secondary special,94518.900000,5357.250000,7096.155000,NaN,4.0
3,100006,0,135000.0,Secondary / secondary special,NaN,23651.175000,62947.088438,0.0,21.0
4,100007,0,121500.0,Secondary / secondary special,146250.000000,12278.805000,12214.060227,NaN,66.0
...,...,...,...,...,...,...,...,...,...
307506,456251,0,157500.0,Secondary / secondary special,NaN,6605.910000,7492.924286,NaN,9.0
307507,456252,0,72000.0,Secondary / secondary special,NaN,10074.465000,10069.867500,NaN,7.0
307508,456253,0,153000.0,Higher education,990000.000000,4770.405000,4115.915357,NaN,17.0
307509,456254,1,171000.0,Secondary / secondary special,45000.000000,10681.132500,10239.832895,NaN,20.0
307510,456255,0,157500.0,Higher education,345629.045455,20775.391875,47646.215878,NaN,71.0

In [23]:
app.memory_usage().sum() / 1024**2

np.float64(15.83665657043457)

In [24]:
app.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 307511 entries, 0 to 307510
Data columns (total 9 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   SK_ID_CURR            307511 non-null  int32
 1   TARGET                307511 non-null  int8
 2   AMT_INCOME_TOTAL      307511 non-null  float64
 3   NAME_EDUCATION_TYPE   307511 non-null  category
 4   AMT_CREDIT_SUM        263490 non-null  float64
 5   AMT_ANNUITY           290640 non-null  float64
 6   AMT_PAYMENT           291635 non-null  float64
 7   AMT_DRAWINGS_CURRENT  86905 non-null   float64
 8   MONTHS_BALANCE        289444 non-null  float64
dtypes: category(1), float64(6), int32(1), int8(1)
memory usage: 15.8 MB

In [32]:
app.to_parquet("home_credit_joined.parquet", index=False)

In [27]:
pip install pyarrow

Collecting pyarrow
  Downloading pyarrow-20.0.0-cp313-cp313-win_amd64.whl.metadata (3.4 kB)
Downloading pyarrow-20.0.0-cp313-cp313-win_amd64.whl (25.7 MB)
   ---------------------------------------- 0.0/25.7 MB ? eta -:--:--
    --------------------------------------- 0.5/25.7 MB 7.0 MB/s eta 0:00:04
   -- ------------------------------------- 1.3/25.7 MB 3.2 MB/s eta 0:00:08
   ---- ----------------------------------- 2.6/25.7 MB 4.2 MB/s eta 0:00:06
   ------ --------------------------------- 3.9/25.7 MB 4.7 MB/s eta 0:00:05
   -------- ------------------------------- 5.2/25.7 MB 5.0 MB/s eta 0:00:05
   --------- ------------------------------ 6.3/25.7 MB 5.1 MB/s eta 0:00:04
   ----------- ---------------------------- 7.6/25.7 MB 5.2 MB/s eta 0:00:04
   ------------- -------------------------- 8.4/25.7 MB 5.2 MB/s eta 0:00:04
   --------------- ------------------------ 9.7/25.7 MB 5.1 MB/s eta 0:00:04
   --------------- ------------------------ 10.2/25.7 MB 4.8 MB/s eta 0:00:04
   ----------------- ---------------------- 11.5/25.7 MB 4.9 MB/s eta 0:00:03
   ------------------- -------------------- 12.6/25.7 MB 4.9 MB/s eta 0:00:03
   --------------------- ------------------ 13.6/25.7 MB 5.0 MB/s eta 0:00:03
   ---------------------- ----------------- 14.7/25.7 MB 4.9 MB/s eta 0:00:03
   ------------------------ --------------- 16.0/25.7 MB 5.0 MB/s eta 0:00:02
   -------------------------- ------------- 17.0/25.7 MB 5.0 MB/s eta 0:00:02
   ---------------------------- ----------- 18.1/25.7 MB 5.0 MB/s eta 0:00:02
   ----------------------------- ---------- 19.1/25.7 MB 4.9 MB/s eta 0:00:02
   ------------------------------- -------- 20.2/25.7 MB 5.0 MB/s eta 0:00:02
   -------------------------------- ------- 21.0/25.7 MB 4.9 MB/s eta 0:00:01
   ---------------------------------- ----- 22.0/25.7 MB 4.9 MB/s eta 0:00:01
   ----------------------------------- ---- 22.8/25.7 MB 4.8 MB/s eta 0:00:01
   ------------------------------------ --- 23.6/25.7 MB 4.8 MB/s eta 0:00:01
   -------------------------------------- - 24.4/25.7 MB 4.8 MB/s eta 0:00:01
   -------------------------------------- - 24.6/25.7 MB 4.6 MB/s eta 0:00:01
   ---------------------------------------  25.4/25.7 MB 4.6 MB/s eta 0:00:01
   ---------------------------------------- 25.7/25.7 MB 4.5 MB/s eta 0:00:00
Installing collected packages: pyarrow
Successfully installed pyarrow-20.0.0
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [28]:
pip install fastparquet

Collecting fastparquet
  Downloading fastparquet-2024.11.0-cp313-cp313-win_amd64.whl.metadata (4.3 kB)
Requirement already satisfied: pandas>=1.5.0 in c:\users\magha\appdata\local\programs\python\python313\lib\site-packages (from fastparquet) (2.3.0)
Requirement already satisfied: numpy in c:\users\magha\appdata\local\programs\python\python313\lib\site-packages (from fastparquet) (2.3.0)
Collecting cramjam>=2.3 (from fastparquet)
  Downloading cramjam-2.10.0-cp313-cp313-win_amd64.whl.metadata (5.1 kB)
Collecting fsspec (from fastparquet)
  Downloading fsspec-2025.5.1-py3-none-any.whl.metadata (11 kB)
Requirement already satisfied: packaging in c:\users\magha\appdata\roaming\python\python313\site-packages (from fastparquet) (25.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\magha\appdata\local\programs\python\python313\lib\site-packages (from pandas>=1.5.0->fastparquet) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\magha\appdata\local\programs\python\python313\lib\site-packages (from pandas>=1.5.0->fastparquet) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\magha\appdata\local\programs\python\python313\lib\site-packages (from pandas>=1.5.0->fastparquet) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\magha\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas>=1.5.0->fastparquet) (1.17.0)
Downloading fastparquet-2024.11.0-cp313-cp313-win_amd64.whl (673 kB)
   ---------------------------------------- 0.0/673.3 kB ? eta -:--:--
   ---------------------------------------- 0.0/673.3 kB ? eta -:--:--
   --------------- ------------------------ 262.1/673.3 kB ? eta -:--:--
   ---------------------------------------- 673.3/673.3 kB 1.7 MB/s eta 0:00:00
Downloading cramjam-2.10.0-cp313-cp313-win_amd64.whl (1.7 MB)
   ---------------------------------------- 0.0/1.7 MB ? eta -:--:--
   ------------------ --------------------- 0.8/1.7 MB 3.4 MB/s eta 0:00:01
   ------------------------------ --------- 1.3/1.7 MB 3.0 MB/s eta 0:00:01
   ---------------------------------------- 1.7/1.7 MB 2.6 MB/s eta 0:00:00
Downloading fsspec-2025.5.1-py3-none-any.whl (199 kB)
Installing collected packages: fsspec, cramjam, fastparquet
Successfully installed cramjam-2.10.0 fastparquet-2024.11.0 fsspec-2025.5.1
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: python.exe -m pip install --upgrade pip